Autodesk.Revit.DB.SpatialElementType
An enumerated type listing types of spaces.
Since:
2014

Autodesk.Revit.DB.SpatialElementType.Space
Space

Autodesk.Revit.DB.SpatialElementType.Area
Area

Autodesk.Revit.DB.SpatialElementType.Room
Room